const 매물종별_일반 = [ '01', '02', '05', '06', '08', '09', '10', '11', '33', '38' ];
const 매물종별_오피스텔 = [ '04', '07', '43', '44' ];

export function 중개보수(param, result) {

  const { 거래가격, 매물종별구분, 매물거래구분, 전용면적, 월차임액 } = param;

  if (!전용면적 || !거래가격 || !매물종별구분 || !매물거래구분) {
    console.log('중개보수 skip');
    return false;
  }
  
  let 매물종별분류 = '03';
  if (매물종별_일반.includes(매물종별구분)) {
    매물종별분류 = '01';
  } else if (매물종별_오피스텔.includes(매물종별구분)) {
    매물종별분류 = '02';
  }

  let data;
  if (매물거래구분 === '01') {

    data = 매매(param, 매물종별분류);

  } else if (매물거래구분 === '02') {

    data = 전세(param, 매물종별분류);

  } else if (매물거래구분 === '03') {

    if (!월차임액) {
      console.log('중개보수 skip 월세 월차임액 없음');
    }

    data = 월세(param, 매물종별분류);

  } else {
    console.log('중개보수 skip 매물거래구분', 매물거래구분);
    return false;
  }

  // 금액 계산
  const { 중개수수료율, 상한금액 = 9999999999, 인정거래가격 } = data;
  const 중개보수 = Math.min((인정거래가격 || 거래가격) * 중개수수료율 * 0.01, 상한금액);

  result.중개보수 = 중개보수;
  result.중개수수료율 = 중개수수료율;
  인정거래가격 && (result.인정거래가격 = 인정거래가격);
  상한금액 && (result.중개수수료상한금액 = 상한금액);

  console.log('중개수수료율', result.중개수수료율, '중개보수', result.중개보수);

  return true;

}

function 매매({ 거래가격, 전용면적 }, 매물종별분류) {

  let 중개수수료율;
  let 상한금액;
  
  if (매물종별분류 === '01') {

    if (거래가격 < 5000) {
      중개수수료율 = 0.6;
      상한금액 = 25;
    } else if (거래가격 < 20000) {
      중개수수료율 = 0.5;
      상한금액 = 80;
    } else if (거래가격 < 90000) {
      중개수수료율 = 0.4;
    } else if (거래가격 < 120000) {
      중개수수료율 = 0.5;
    } else if (거래가격 < 150000) {
      중개수수료율 = 0.6;
    } else {
      중개수수료율 = 0.7;
    }

  } else if (매물종별분류 === '02') {

    if (전용면적 <= 85) {
      중개수수료율 = 0.5;
    } else {
      중개수수료율 = 0.9;
    }

  } else {
    중개수수료율 = 0.9;
  }

  return { 중개수수료율, 상한금액 };

}

function 전세({ 거래가격, 전용면적 }, 매물종별분류) {
  let 중개수수료율;
  let 상한금액;
  
  if (매물종별분류 === '01') {

    if (거래가격 < 5000) {
      중개수수료율 = 0.5;
      상한금액 = 20;
    } else if (거래가격 < 10000) {
      중개수수료율 = 0.4;
      상한금액 = 30;
    } else if (거래가격 < 60000) {
      중개수수료율 = 0.3;
    } else if (거래가격 < 120000) {
      중개수수료율 = 0.4;
    } else if (거래가격 < 150000) {
      중개수수료율 = 0.5;
    } else {
      중개수수료율 = 0.6;
    }

  } else if (매물종별분류 === '02') {

    if (전용면적 <= 85) {
      중개수수료율 = 0.4;
    } else {
      중개수수료율 = 0.9;
    }

  } else {
    중개수수료율 = 0.9;
  }

  return { 중개수수료율, 상한금액 };
}

function 월세({ 거래가격, 전용면적, 월차임액 }, 매물종별분류) {

  let 중개수수료율;
  let 상한금액;

  let 인정거래가격 = 거래가격 + (월차임액 * 100);
  if (인정거래가격 < 5000) {
    인정거래가격 = 거래가격 + (월차임액 * 70);
  }
  
  if (매물종별분류 === '01') {

    if (인정거래가격 < 5000) {
      중개수수료율 = 0.5;
      상한금액 = 20;
    } else if (인정거래가격 < 10000) {
      중개수수료율 = 0.4;
      상한금액 = 30;
    } else if (인정거래가격 < 60000) {
      중개수수료율 = 0.3;
    } else if (인정거래가격 < 120000) {
      중개수수료율 = 0.4;
    } else if (인정거래가격 < 150000) {
      중개수수료율 = 0.5;
    } else {
      중개수수료율 = 0.6;
    }
  } else if (매물종별분류 === '02') {

    if (전용면적 <= 85) {
      중개수수료율 = 0.4;
    } else {
      중개수수료율 = 0.9;
    }

  } else {
    중개수수료율 = 0.9;
  }

  return { 중개수수료율, 상한금액, 인정거래가격 };
}